In [1]:
import pandas as pd

In [3]:
d1=[100,200,300,400,500]
d2=(501,502,503,504,505)
d3=['pune','mumbai','nashik','delhi','banglore']
d4={'A':11,'B':12,'C':13,'D':14,'E':15}

In [5]:
pd.Series(d1)

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [7]:
type(pd.Series(d1))

pandas.core.series.Series

In [9]:
pd.Series(data=d3,index=d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [11]:
pd.Series(d3,d1)

100        pune
200      mumbai
300      nashik
400       delhi
500    banglore
dtype: object

In [13]:
pd.Series(d3,d2)

501        pune
502      mumbai
503      nashik
504       delhi
505    banglore
dtype: object

In [17]:
d4

{'A': 11, 'B': 12, 'C': 13, 'D': 14, 'E': 15}

In [19]:
pd.Series(d4)

A    11
B    12
C    13
D    14
E    15
dtype: int64

In [21]:
pd.Series(d4,d3)

pune       NaN
mumbai     NaN
nashik     NaN
delhi      NaN
banglore   NaN
dtype: float64

In [23]:
pd.Series(d3,d4)

A        pune
B      mumbai
C      nashik
D       delhi
E    banglore
dtype: object

In [25]:
s1=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','delhi','banglore'])

In [27]:
s2=pd.Series([10,20,30,40,50],['pune','mumbai','nashik','hyderabad','banglore'])

In [29]:
s1

pune        10
mumbai      20
nashik      30
delhi       40
banglore    50
dtype: int64

In [31]:
s2

pune         10
mumbai       20
nashik       30
hyderabad    40
banglore     50
dtype: int64

In [33]:
##Dataframe

In [35]:
import numpy as np

In [37]:
np.random.randn(5,4)

array([[-1.06508699, -1.27671733, -0.12062383,  1.01363578],
       [ 0.51449509,  0.66754409,  1.31199261,  0.19676284],
       [-2.0057285 ,  0.27742102,  0.27598817, -2.11484303],
       [-0.95097018,  0.67279407, -2.07338144, -0.51211001],
       [ 0.1105734 , -1.13718514, -0.18319812, -0.08250463]])

In [39]:
data=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [41]:
data

          W         X         Y         Z
A -0.590513  0.176103  0.659665 -0.166665
B -1.086267 -0.625029 -1.055746  0.838393
C  1.359273  0.406839  0.891052  0.353760
D -1.871311  0.322920 -1.746517  0.500430
E -0.278017 -0.767353  0.294122 -0.296384

In [43]:
type(data)

pandas.core.frame.DataFrame

In [45]:
data.shape

(5, 4)

In [47]:
data

          W         X         Y         Z
A -0.590513  0.176103  0.659665 -0.166665
B -1.086267 -0.625029 -1.055746  0.838393
C  1.359273  0.406839  0.891052  0.353760
D -1.871311  0.322920 -1.746517  0.500430
E -0.278017 -0.767353  0.294122 -0.296384

In [49]:
data.loc['B']

W   -1.086267
X   -0.625029
Y   -1.055746
Z    0.838393
Name: B, dtype: float64

In [54]:
type(data.loc['B'])

pandas.core.series.Series

In [58]:
data[['W']]

          W
A -0.590513
B -1.086267
C  1.359273
D -1.871311
E -0.278017

In [60]:
data.loc['B','Y']

-1.05574617137986

In [66]:
data[data['W']>0]['Z']

C    0.35376
Name: Z, dtype: float64

In [64]:
data.loc[data['W'] > 0, 'Z']

C    0.35376
Name: Z, dtype: float64

In [68]:
data

          W         X         Y         Z
A -0.590513  0.176103  0.659665 -0.166665
B -1.086267 -0.625029 -1.055746  0.838393
C  1.359273  0.406839  0.891052  0.353760
D -1.871311  0.322920 -1.746517  0.500430
E -0.278017 -0.767353  0.294122 -0.296384

In [72]:
data['new_column']=data['W']+data['X']

In [74]:
data

          W         X         Y         Z  new_column
A -0.590513  0.176103  0.659665 -0.166665   -0.414410
B -1.086267 -0.625029 -1.055746  0.838393   -1.711296
C  1.359273  0.406839  0.891052  0.353760    1.766111
D -1.871311  0.322920 -1.746517  0.500430   -1.548392
E -0.278017 -0.767353  0.294122 -0.296384   -1.045369

In [86]:
data.drop('new_column',axis=1)

          W         X         Y         Z
A -0.590513  0.176103  0.659665 -0.166665
B -1.086267 -0.625029 -1.055746  0.838393
C  1.359273  0.406839  0.891052  0.353760
D -1.871311  0.322920 -1.746517  0.500430
E -0.278017 -0.767353  0.294122 -0.296384

In [89]:
data.drop("new_column",axis=1,inplace=True)

In [91]:
d3

['pune', 'mumbai', 'nashik', 'delhi', 'banglore']

In [93]:
data.index=d3
data

                 W         X         Y         Z
pune     -0.590513  0.176103  0.659665 -0.166665
mumbai   -1.086267 -0.625029 -1.055746  0.838393
nashik    1.359273  0.406839  0.891052  0.353760
delhi    -1.871311  0.322920 -1.746517  0.500430
banglore -0.278017 -0.767353  0.294122 -0.296384

In [95]:
data.reset_index()

      index         W         X         Y         Z
0      pune -0.590513  0.176103  0.659665 -0.166665
1    mumbai -1.086267 -0.625029 -1.055746  0.838393
2    nashik  1.359273  0.406839  0.891052  0.353760
3     delhi -1.871311  0.322920 -1.746517  0.500430
4  banglore -0.278017 -0.767353  0.294122 -0.296384

In [101]:
data.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [103]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, pune to banglore
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 200.0+ bytes

In [105]:
##multi index and index hierarchy

In [107]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]

In [111]:
h1=list(zip(outside,inside))

In [113]:
h1

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [117]:
hier_index = pd.MultiIndex.from_tuples(h1)

In [119]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [125]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [127]:
df.index.names = ['Group','Num']

In [129]:
df.xs('G1')

            A         B
Num
1   -1.181000  0.538708
2    0.916033  0.349477
3   -2.149947  1.544264

In [133]:
df.xs(('G1',1))

A   -1.181000
B    0.538708
Name: (G1, 1), dtype: float64

In [135]:
df.xs(('G2',2))

A   -1.269894
B    0.262112
Name: (G2, 2), dtype: float64

In [139]:
df.xs(1,level='Num')

              A         B
Group
G1    -1.181000  0.538708
G2    -0.255929  1.586811

In [141]:
##Missin data

In [143]:
import numpy as nu
import pandas as pd

In [145]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [147]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [149]:
df=pd.DataFrame(d)

In [151]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [153]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [157]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [159]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [163]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [165]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
df.dropna(thresh=1) #atleast one non null

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [181]:
df.dropna(thresh=3,axis=1) #atleast three non null

   C
0  1
1  2
2  3

In [183]:
df['A'].fillna(df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [185]:
df.fillna(df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3